#Quiz 2.1 

#ვერ მოვახერხე ბოლომდე დასრულება ყველაფრის

"""
---როგორ შევქმნნათ ლისტი (მასივი)?    
*
1 point

a = list()
a = []
--------------------------
 
This is a required question
---საიდან იწყება მასივის ინდექსების ათვლა 
*
1 point
0
--------------------------
----ლისტზე (მასივზე) ელემენტზე წვდომა როგორ ხდება? (დაწერეთ მაგალითი, ჩავთვალოთ გვაქვს ცვლადი arr რომელიც ლისტის ტიპისაა)
*
1 point
print(arr[])   ვწერთ ლისტის სახელს შემდეგ იმ ელემენტის ინდექსს რაზეც გვინდა წვდომა. 
--------------------------
---რა არის Index Error?  - როდესაც ისეთ ინდექს მივუთითებთ რომელიც ლისტში არაა, ანუ ლისტის ზომას თუ ცდება ჩვენი მითითებულ იინდექს, მაგ თუ ლისტში არის 5 ელემენტი, ჩვენ მივუთითებთ ინდექსსში 10-ს.
1 point
როდესაც ისეთ ინდექს მივუთითებთ რომელიც ლისტში არაა, ანუ ლისტის ზომას თუ ცდება ჩვენი მითითებულ იინდექს, მაგ თუ ლისტში არის 5 ელემენტი, ჩვენ მივუთითებთ ინდექსსში 10-ს.
--------------------------
---როგორ ხდება ლისტში (მასივში), ელემენტების ჩამატება?
*
1 point
ვიყენებთ .append თუ ბოლოში გვინდა დამატება, ვიყენებთ .insert და ელემენტის ინდექსი სადაც გვსურს ჩამატება.
--------------------------
---როგორ გავიგოთ ლისტის ზომა?
*
1 point
ვიყენებთ len - ფუნქციას მაგ len(list)
--------------------------
---დაბეჭდეთ თითოეული მასივის ელემენტი ტერმინალში (გამოიყენეთ for ან while ციკლი)
*
1 point
users = ["james", "jane", "john"]
for user in users:
    print(user)
---დაბეჭდეთ კენტ ინდექსზე მდგომი  მასივის ელემენტები ტერმინალში
*
2 points
list = [1, 2, 3, 4, 5, 6, 7, 8, 9]
odd = list[0::2]
for element in odd:
    print(element)
--------------------------
დათვალეთ ტერმინალიდან შემოტანილი ათი რიცხვის ჯამი (hint: არ შექმნათ 10 ცვლადი)
*
1 point
შექმენით 10 ელემენტიანი ლისტი და შეავსეთ კლავიატურიდან შეტანილი მთელი რიცხვებით. შემდეგ თითოეული ელემენტი ლისტში აიყვანეთ მომდევნო ინდექსზე მდგომი ელემენტის ხარისხში
 (ბოლო ინდექსზე მდგომი ელემენტი აიყვანეთ პირველი ელემენტის ხარისხში)
*
3 points

--------------------------
რას აკეთებს for else?
*
1 point
for else არის ლუპი, იმ შემტხვევაში სრულდება თუ ლუპი დასრულდება break - ის გარეშე
--------------------------
გაარკვიეთ ლისტში არსებობს თუ არა 1 მარტივი რიცხვი მაინც, შეეცადეთ კოდი იყოს ოპტიმიზირებული, ანუ რაც შეიძლება ნაკლები იტერაცია იყოს!. (hint: for else, break)
*
1 point
რა მონაცემთა ტიპებს შეიძლება შეიცავდეს list/tuple?
1 point
ისეთ ელემენტებს რომელიც არ უნდა შეიცვალოს 
--------------------------
შექმენით ლისტი, ტერმინალიდან შეავსეთ 5 ელემენტით და შემდეგ თითოეული ელემენტი ააკვადრატეთ და შემდგომ დაბეჭდეთ ეკრანზე (ლისტი უნდა შეიცვალოს!)
2 points

--------------------------
როგორ მივუთითოთ ლისტში რა ტიპის ელემენტები გვაქვს? (მაგალითად აიღეთ თქვენთვის სასურველი მონაცემთა ტიპი)
*


--------------------------1 point
მეგობრისთვის გინდათ სამეგობრომ იყიდოთ ლეპტოპი, თქვენმა მეგობარმა მოგცათ ლეპტოპების ფასების სია - prices = [1336, 4434, 5100, 2000, 750, 1000, 1250, 500, 14050, 3000, 2300, 5110],
 კლავიატურიდან შემოიტანეთ ბიუჯეტი (თანხის ოდენობა რაც გაქვთ შეკრული) და ამ სიიდან გაფილტრეთ ისეთი ლეპტოპები რომლებიც 500 ლარით იაფია ბიუჯეტზე ან არ გყოფნით თანხა და დაბეჭდეთ დანარჩენი ლეპტოპების ფასები
 (ლისტი არ შეცვალოთ!)
 5 points

 --------------------------
(ბონუსი) შექმენით ორი მასივი (ლისტი)  ორივე შეავსეთ 1000 - 1000 ელემენტით, კენტები 1 მასივში ლუწები მეორეში. შემდეგ კენტების მასივის ელემენტები აიყვანეთ ლუწი მასივის ელემენტების ხარისხში odd_element ^ ((even_element - 1)/ even_element^2). და ბოლოს ლუწების მასივის თითოეული ელემენტი გაყავით კენტების ელემენტებზე. (P.S ორივე მასივის ელემენტები უნდა შეიცვალოს!)
*
5 points


--------------------------
(ბონუსი) მომხმარებელს (user - ს) კლავიატურითან შემოატანინეთ წელი, თქვენი დავალებაა გაარკვიოთ შემოტანილი წელი ნაკიანია თუ არა
10 points


--------------------------
(ბონუსი) მომხმარებელს კლავიატურიდან შემოატანინეთ რიცვხი, გაარკვიეთ რიცხვი ლუწია თუ კენტი (პროგრამამ უნდა იმუშაოს ნებისმიერ მთელ რიცხვზე რა ზომისაც არ უნდა იყოს ის. გაითვალისწინეთ პითონში რიცხვის მაქსიმალური ზომა დამოკიდებულია თქვენს ოპერატიულზე, ამიტომაც სხვა გზა უნდა იპოვოთ)
10 points



--------------------------
"""